var a = new Array()
a[0] = '<strong>Шаурма</strong><br><p>Ближневосточное блюдо из мяса (курица, ягнятина, баранина, реже — свинина), обжаренного на вертеле, или фалафеля, завёрнутого в лаваш, реже — в питу, с добавлением капусты, свежего огурца, репчатого лука, чесночного соуса и, по желанию, специй. Употребляется без использования столовых приборов.</p><img src="img/1.jpg">'
a[1] = '<strong>Лазанья</strong><br><p>Макаронное изделие, тонкий лист теста в форме квадрата или прямоугольника, а также блюдо итальянской кухни, традиционно приготовляемое из тонких листов теста (собственно и называющихся лазанья) со слоями различной начинки. По-итальянски, блюдо, в отличие от используемых для него макаронных изделий, может называться лаза́нья аль фо́рно</p><img src="img/2.jpg">'
a[2] = '<strong>Чебурек</strong><br><p>Изначально блюдо крымскотатарской кухни, также входит в кухню мариупольских греков (под названием чир-чир) и северокавказских народов. Получило распространение и в других регионах бывшего Советского Союза.</p><img src="img/3.jpg">'
a[3] = '<strong>Жаркое из капусты и картофеля</strong><br><p>Традиционное английское блюдо с жареными овощами, подаваемое в традиционный для Великобритании воскресный обед.</p><img src="img/4.jpg">'
a[4] = '<strong>Гречневая каша</strong><br><p>Каша, приготавливаемая из гречишного зерна, популярное блюдо русской, белорусской, украинской, литовской и польской кухонь.</p><img src="img/5.jpg">'
a[5] = '<strong>Макароны по-флотски</strong><br><p>Блюдо из макаронных изделий с измельчённым ранее отваренным, а затем обжаренным мясом в сливочном масле и луком. Рецепт сформировался в СССР в 1950-х годах.</p><img src="img/6.jpg">'
a[6] = '<strong>Сосиски в тесте</strong><br><p>Сосиска, покрытая спирально накрученным в форме «колбаски» сдобным или слоёным тестом и запечённая в жаровом шкафу. Сосиска в тесте — кулинарное изделие, пользующееся спросом во всём мире. Особенно популярны в школьных и студенческих столовых.</p><img src="img/7.jpg">'
a[7] = '<strong>Винегрет</strong><br><p>Холодное блюдо русской кухни, закуска, разновидность салата, обязательным ингредиентом которого в современной кулинарии является отварная или печёная свёкла. Наряду с оливье являлся традиционным салатом советской кухни, уступая ему в благородности и праздничности.</p><img src="img/8.jpg">'
a[8] = '<strong>Вареники</strong><br><p>Украинское национальное блюдо в виде отварных изделий из пресного теста с начинкой из отварного мяса, овощей, грибов, фруктов, творога, картофеля и ягод. Вареники в XIX веке были известны также крестьянам Курской губернии. Сходно с марийским блюдом подкогыльо.</p><img src="img/9.jpg">'
a[9] = '<strong>Плов</strong><br><p>Блюдо восточной кухни, основу которого составляет варёный рис (в исключительных случаях — другая крупа или мелкие макаронные изделия). Отличительным свойством плова является его рассыпчатость, достигаемая соблюдением технологии приготовления риса и добавлением в плов животного или растительного жира, препятствующего слипанию крупинок.</p><img src="img/10.jpg">'
a[10] = '<strong>Карбонара</strong><br><p>Спагетти с мелкими кусочками гуанчиале или панчетты (иногда заменяют на бекон), смешанные с соусом из яиц, сыра пекорино романо (иногда заменяют или добавляют пармезан), соли и свежемолотого чёрного перца. Этот соус доходит до полной готовности от тепла только что сваренной пасты.</p><img src="img/11.jpg">'
a[11] = '<strong>Пицца</strong><br><p>Традиционное итальянское блюдо изначально в виде круглой дрожжевой лепёшки, выпекаемой с уложенной сверху начинкой из томатного соуса, сыра и зачастую других ингредиентов, таких как мясо, овощи, грибы и других продуктов. Небольшую пиццу иногда называют пиццеттой. Повар, специализирующийся на приготовлении пиццы, — пиццайоло.</p><img src="img/12.jpg">'
a[12] = '<strong>Хот-дог</strong><br><p>Хот-дог — это блюдо, состоящее из жареной или приготовленной на пару сосиски, подаваемой в разрезе булочки. Термин «хот-дог» также может относиться и к самой сосиске. Используется венская сосиска или франкфуртер. Названия этих сосисок также обычно относятся к блюду, в котором они собраны.</p><img src="img/13.jpg">'
a[13] = '<strong>Греческий салат</strong><br><p>Из помидоров, сладкого перца, огурцов, феты, шалота и маслин, заправленный оливковым маслом с солью, чёрным перцем, душицей. Ключевым ингредиентом салата является фета — традиционный греческий сыр из овечьего или козьего молока. В салат иногда добавляют — каперсы или анчоусы.</p><img src="img/14.jpg">'
a[14] = '<strong>Хачапури</strong><br><p>Блюдо грузинской кухни, национальное мучное изделие, булка с начинкой из сыра. В 2019 году хачапури присвоен статус нематериального памятника культурного наследия Грузии. Единого рецепта хачапури не существует — в каждом регионе блюдо готовят по-своему.</p><img src="img/15.jpg">'
a[15] = '<strong>Сырный суп</strong><br><p>Питательный суп, основным компонентом которого является расплавленный сыр. В рецептуру сырных супов обычно входит небольшое число других ингредиентов.</p><img src="img/16.jpg">'
a[16] = '<strong>Цезарь</strong><br><p>Овощной салат. Популярное блюдо американской кухни. В классической версии основными ингредиентами салата являются пшеничные гренки, листья салата ромэн и тёртый пармезан, заправленные особым соусом, который и составляет суть рецепта.</p><img src="img/17.jpg">'
a[17] = '<strong>Макароны с сыром</strong><br><p>Блюдо из вареных макарон с сыром (сырным соусом), чаще всего это чеддер. Оно также может включать другие ингредиенты, такие как панировочные сухари, мясо и овощи.</p><img src="img/18.jpg">'
a[18] = '<strong>Окрошка</strong><br><p>Традиционный холодный суп русской кухни, который готовят в весенне-летний период. Обязательными компонентами окрошки являются хлебный (ржаной, ячменный) квас, свежие огурцы, укроп, растёртый с солью зелёный лук, столовая горчица, крутое яйцо и сметана.</p><img src="img/19.jpg">'
a[19] = '<strong>Кротовуха</strong><br><p>Алкогольный напиток, настоянный на мертвом кроте.</p><img src="img/20.jpg">'

var btn = document.getElementById('butt');
var div = document.getElementById('fig');

function Random()
{
    return a[Math.floor(Math.random() * a.length)]
}

btn.onclick = function()
{
    div.innerHTML = Random();
    div.style.opacity = '1';
}